<template>
<v-app id="app">
  <div>
    <v-dialog
      v-model="dialog"
      width="800"
    >
      <template v-slot:activator="{ on, attrs }">
        <v-btn
          color="red lighten-2"
          dark
          v-bind="attrs"
          v-on="on"
        >
          利用規約を確認する
        </v-btn>
      </template>

      <v-card>
        <v-card-title class="text-h5 grey lighten-2">
          利用規約
        </v-card-title>

        <v-card-text>
        ■第1条（総則）<br>
        本規約は、大学ポリシー検索ツール運営者（以下、当方という）が提供する「大学ポリシー検索ツール」（以下、本サービスという）を、第２条で規定する登録ユーザが利用することについての一切に適用されます。<br>
        ■第２条（登録ユーザ）<br>
        １．登録ユーザとは、本サービスにおいて、所定の手続に従って登録の申込みを行った方をさします。<br>
        ２．登録ユーザは、本サービスを無料でご利用できます。<br>
        ■第３条（ＩＤ（e‐mailｱﾄﾞﾚｽ）およびパスワードの管理責任）<br>
        ＩＤ（e‐mailｱﾄﾞﾚｽ）およびパスワードの管理ならびに使用は登録ユーザの責任とし、使用上の過誤、第三者の不正な使用等について、当方は一切その責任を負わないものとします。<br>
        ■第４条（登録抹消）<br>
      次のいずれかに該当する場合、当方は、登録ユーザに事前に通知することなく、ユーザ登録を抹消することができます。<br>
      ①登録ユーザが実在しないとき<br>
      ②その他、登録ユーザとして不適当であると当方が判断したとき<br>
      ■第５条（権利譲渡の禁止）<br>
      登録ユーザは、本サービスを利用する権利を第三者に譲渡することはできないものとします。<br>
      ■第６条（個人情報の取扱い）<br>
      当方は、登録ユーザの個人情報について、ご本人の同意を得ず第三者に提供することはありません。<br>
      ■第７条（禁止事項）<br>
      １．登録ユーザは、本サービスを利用するにあたり、次の行為を行わないものとします。<br>
      ①自らのＩＤ（e‐mailｱﾄﾞﾚｽ）、パスワードを公開する行為<br>
      ②他人の財産やプライバシーを侵害する行為<br>
      ③有害なコンピュータープログラム等を送信、または書込む行為<br>
      ④国内外の他のネットワークを経由して通信を行う場合、経由する国内外のネットワークの規則に反する行為<br>
      ⑤本サービスを営利目的で利用する行為<br>
      ⑥その他本サービスの運営を妨げるような行為<br>
      ⑦その他法令に違反し、または違反する恐れのある行為<br>
      ⑧その他当方が不適切と判断する行為<br>
      ２．登録ユーザが前項の禁止事項に抵触した場合、当方は、登録ユーザに事前に通知することなく、ユーザ登録を抹消することができるものとします。<br>        
      ■第８条（サービス内容の変更）<br>
      １．登録ユーザに事前通知することなく本サービスの内容・名称を変更することがあります。<br>
      ２．前項の変更により登録ユーザに生じた損害について、当方は一切の責任を負いません。<br>
      ■第９条（本サービスの一時的な中断）<br>
      １．以下のいずれかの事由が生じた場合には、登録ユーザに事前に通知することなく、一時的に本サービスを中断することがあります。<br>
      ①本サービス用設備等の保守を定期的にまたは緊急に行う場合<br>
      ②運用上または技術上の問題で本サービスの一時的な中断が必要であると判断した場合<br>
      ２．当方は、前項各号のいずれか、またはその他の事由により本サービスの提供が遅延または中断等が発生したとしても、これに起因する登録ユーザまたは他者が被った損害について、一切責任を負わないものとします。<br>
      ■第１０条（本サービスの提供終了）<br>
      １．当方は、本サービスの提供を終了し、本規約を解除することができます。<br>
      ２．当方は、前項に基づく本サービスの提供終了に関し、一切の責任を負わないものとします。<br>
      ■第１１条（損害賠償）<br>
      登録ユーザが、本規約に違反する行為または不正もしくは違法な行為によって、当方に損害を与えた場合には、当方は、登録ユーザに対して、当社の被った損害の賠償を請求することができるものとします。<br>
      ■第１２条（免責）<br>
      １．当方は、登録ユーザが本サービスの利用により被った損害や、本サービスを通じて登録、提供された情報が消失した場合においても、一切責任を負わないものとします。<br>
      ２．登録ユーザは、本サービスの利用に関して第三者との間で紛争が生じた場合、当該紛争を自らの責任と費用で解決し、当方を免責するものとします。<br>      
      ■第１３条（登録情報等の利用）<br>
      登録ユーザから本サービスへ登録された情報や本サービスに寄せられた提案、意見、感想その他の情報は、今後、当サービスを改善していくうえで参考とさせていただくほか、本サービスの周知活動等に利用者が特定されない形で引用することがございます。<br>
        </v-card-text>

        <v-divider></v-divider>

        <v-card-actions>
          <v-spacer></v-spacer>
          <v-btn
            color="primary"
            text
            @click="dialog = false"
          >
            閉じる
          </v-btn>
        </v-card-actions>
      </v-card>
    </v-dialog>
 </div>
</v-app>
</template>

<script>
export default {
    data () {
      return {
        dialog: false,
      }
    }
  }
</script>
